lsh0223/stm32websystem/stm32Project/USER/main.c
static void UI_DrawInuseStatic(void)
{
    LCD_Clear(WHITE);
    LCD_Fill(0, 0, lcddev.width - 1, 30, BLUE);
    POINT_COLOR = WHITE; BACK_COLOR  = BLUE;
    Show_Str(10, 5, lcddev.width - 90, 24, (u8 *)"上机中", 24, 0); 
    UI_UpdateWifiIcon();
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    Show_Str(10, 32, lcddev.width - 20, 16, (u8 *)"费率: 1元/分钟(测试)", 16, 0);
    Show_Str(10, 50,  70, 16, (u8 *)"状态:", 16, 0);
    Show_Str(10, 70,  70, 16, (u8 *)"用户:", 16, 0);
    Show_Str(10, 90,  70, 16, (u8 *)"卡号:", 16, 0);
    Show_Str(10, 110, 70, 16, (u8 *)"余额:", 16, 0);
    Show_Str(10, 130, 70, 16, (u8 *)"时长:", 16, 0);
    Show_Str(10, 150, 70, 16, (u8 *)"费用:", 16, 0);
    LCD_DrawRectangle(BTN_PC_X1, BTN_PC_Y1, BTN_PC_X2, BTN_PC_Y2);             
    LCD_DrawRectangle(BTN_LIGHT_X1, BTN_LIGHT_Y1, BTN_LIGHT_X2, BTN_LIGHT_Y2); 
    LCD_DrawRectangle(BTN_EXIT_X1, BTN_EXIT_Y1, BTN_EXIT_X2, BTN_EXIT_Y2);     
    Show_Str(10, 280, 80, 16, (u8 *)"座位:", 16, 0);
    Show_Str(10, 300, 80, 16, (u8 *)"烟雾:", 16, 0);
    Show_Str(10, 320, 120, 16, (u8 *)"费率:1元/分钟", 16, 0);
    LCD_Fill(70, 280, lcddev.width - 10, 336, WHITE);
}

static void UI_UpdateEnvWelcome(u8 human, u8 smoke_percent)
{
    char buf[16];
    u8  *level;
    LCD_Fill(70, 90, lcddev.width - 10, 106, WHITE);
    if (human) { POINT_COLOR = RED; Show_Str(70, 90, lcddev.width - 80, 16, (u8 *)"有人", 16, 0); }
    else { POINT_COLOR = BLACK; Show_Str(70, 90, lcddev.width - 80, 16, (u8 *)"无人", 16, 0); }
    LCD_Fill(70, 110, lcddev.width - 10, 126, WHITE);
    sprintf(buf, "%3d%%", smoke_percent);
    POINT_COLOR = BLACK;
    LCD_ShowString(70, 110, 80, 16, 16, (u8 *)buf);
    level = Smoke_LevelText(smoke_percent);
    Show_Str(150, 110, 100, 16, level, 16, 0);
    if ((smoke_percent >= 60) || (g_idle_occupy_alarm)) Seat_Buzzer_Set(1);
    else Seat_Buzzer_Set(0);
    POINT_COLOR = BLACK;
}

static void UI_UpdateEnvInuse(u8 human, u8 smoke_percent)
{
    char buf[16];
    u8  *level;
    LCD_Fill(70, 280, lcddev.width - 10, 296, WHITE);
    if (human) { POINT_COLOR = RED; Show_Str(70, 280, lcddev.width - 80, 16, (u8 *)"有人", 16, 0); }
    else { POINT_COLOR = BLACK; Show_Str(70, 280, lcddev.width - 80, 16, (u8 *)"无人", 16, 0); }
    LCD_Fill(70, 300, lcddev.width - 10, 316, WHITE);
    sprintf(buf, "%3d%%", smoke_percent);
    POINT_COLOR = BLACK;
    LCD_ShowString(70, 300, 80, 16, 16, (u8 *)buf);
    level = Smoke_LevelText(smoke_percent);
    Show_Str(150, 300, 100, 16, level, 16, 0);
    if (smoke_percent >= 60) Seat_Buzzer_Set(1);
    else Seat_Buzzer_Set(0);
    POINT_COLOR = BLACK;
}

static void UI_UpdateStateLine(void)
{
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 50, 310, 66, WHITE);
    if (g_app.state == STATE_IDLE) Show_Str(80, 50, 230, 16, (u8 *)"待机", 16, 0);
    else Show_Str(80, 50, 230, 16, (u8 *)"上机中", 16, 0);
}

static void UI_UpdateUserLine(void)
{
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 70, 310, 86, WHITE);
    if (g_app.state == STATE_IDLE || g_app.has_user == 0) Show_Str(80, 70, 230, 16, (u8 *)"--", 16, 0);
    else Show_Str(80, 70, 230, 16, g_app.user_name, 16, 0);
}

static void UI_UpdateCardLine(void)
{
    char buf[24];
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 90, 310, 106, WHITE);
    if (g_app.has_user) {
        sprintf(buf, "%02X %02X %02X %02X", g_app.uid[0], g_app.uid[1], g_app.uid[2], g_app.uid[3]);
        LCD_ShowString(80, 90, 230, 16, 16, (u8 *)buf);
    } else Show_Str(80, 90, 230, 16, (u8 *)"--", 16, 0);
}

static void UI_UpdateBalanceLine(void)
{
    char buf[24];
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 110, 310, 126, WHITE);
    sprintf(buf, "%lu.%02lu 元", g_app.balance / 100, g_app.balance % 100);
    Show_Str(80, 110, 230, 16, (u8 *)buf, 16, 0);
}

static void UI_UpdateRuntimeAndFee(void)
{
    u32 fee;
    char buf[24];
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    LCD_Fill(80, 130, 310, 146, WHITE);
    sprintf(buf, "%02lu:%02lu", g_app.used_seconds / 60, g_app.used_seconds % 60);
    Show_Str(80, 130, 230, 16, (u8 *)buf, 16, 0);
    fee = (g_app.used_seconds / 60) * PRICE_PER_MIN;
    LCD_Fill(80, 150, 310, 166, WHITE);
    sprintf(buf, "%4lu 元", fee);
    Show_Str(80, 150, 230, 16, (u8 *)buf, 16, 0);
}

static void Netbar_Publish_SeatState(void)
{
    char payload[96];
    u8 human, iu, smoke_percent;
    u16 smoke_adc;
    u32 used_seconds, fee;

    if (ESP8266_GetState() != WIFI_STATE_CONNECTED) return;

    human = Seat_Radar_Get();
    smoke_adc = Seat_Smoke_GetRaw();
    smoke_percent = Smoke_AdcToPercent(smoke_adc);
    iu = (g_app.state == STATE_INUSE) ? 1 : 0;
    used_seconds = g_app.used_seconds;
    fee = (used_seconds / 60) * PRICE_PER_MIN;

    // ★★★ 修复：增加 occ 参数，上报占座报警状态 ★★★
    sprintf(payload, "s=1;iu=%d;pc=%d;lt=%d;hm=%d;sm=%d;sec=%lu;fee=%lu;occ=%d",
            iu, g_app.pc_on, g_app.light_on, human, smoke_percent, used_seconds, fee, g_idle_occupy_alarm);

    publish_seq++;
    printf("STATE #%lu, payload: %s\r\n", publish_seq, payload);
    ESP8266_MQTT_Publish("netbar/seat001/state", payload, 0, 0);
}

static void UI_UpdatePCButton(void)
{
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    if (g_app.pc_on) {
        LCD_Fill(BTN_PC_X1 + 1, BTN_PC_Y1 + 1, BTN_PC_X2 - 1, BTN_PC_Y2 - 1, GREEN);
        Show_Str(BTN_PC_X1 + 20, BTN_PC_Y1 + 12, 100, 16, (u8 *)"关电脑", 16, 0);
    } else {
        LCD_Fill(BTN_PC_X1 + 1, BTN_PC_Y1 + 1, BTN_PC_X2 - 1, BTN_PC_Y2 - 1, GRAY);
        Show_Str(BTN_PC_X1 + 20, BTN_PC_Y1 + 12, 100, 16, (u8 *)"开电脑", 16, 0);
    }
    LCD_DrawRectangle(BTN_PC_X1, BTN_PC_Y1, BTN_PC_X2, BTN_PC_Y2);
}

static void UI_UpdateLightButton(void)
{
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
    if (g_app.light_on) {
        LCD_Fill(BTN_LIGHT_X1 + 1, BTN_LIGHT_Y1 + 1, BTN_LIGHT_X2 - 1, BTN_LIGHT_Y2 - 1, GREEN);
        Show_Str(BTN_LIGHT_X1 + 20, BTN_LIGHT_Y1 + 12, 100, 16, (u8 *)"关灯光", 16, 0);
    } else {
        LCD_Fill(BTN_LIGHT_X1 + 1, BTN_LIGHT_Y1 + 1, BTN_LIGHT_X2 - 1, BTN_LIGHT_Y2 - 1, GRAY);
        Show_Str(BTN_LIGHT_X1 + 20, BTN_LIGHT_Y1 + 12, 100, 16, (u8 *)"开灯光", 16, 0);
    }
    LCD_DrawRectangle(BTN_LIGHT_X1, BTN_LIGHT_Y1, BTN_LIGHT_X2, BTN_LIGHT_Y2);
    LCD_Fill(BTN_EXIT_X1 + 1, BTN_EXIT_Y1 + 1, BTN_EXIT_X2 - 1, BTN_EXIT_Y2 - 1, RED);
    POINT_COLOR = WHITE; BACK_COLOR  = RED;
    Show_Str(BTN_EXIT_X1 + 20, BTN_EXIT_Y1 + 12, 120, 16, (u8 *)"下机结算", 16, 0);
    LCD_DrawRectangle(BTN_EXIT_X1, BTN_EXIT_Y1, BTN_EXIT_X2, BTN_EXIT_Y2);
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
}

static void UI_UpdateWifiIcon(void)
{
    WifiState cur = ESP8266_GetState();
    u16 base_x = lcddev.width - 40, base_y = 6;
    POINT_COLOR = WHITE; BACK_COLOR  = BLUE;
    LCD_Fill(lcddev.width - 70, 0, lcddev.width - 1, 30, BLUE);
    if (cur == WIFI_STATE_CONNECTED) {
        LCD_Fill(base_x, base_y + 8, base_x + 6, base_y + 14, WHITE);
        LCD_Fill(base_x + 8, base_y + 4, base_x + 14, base_y + 14, WHITE);
        LCD_Fill(base_x + 16, base_y, base_x + 22, base_y + 14, WHITE);
    } else if (cur == WIFI_STATE_CONNECTING) {
        LCD_Fill(base_x, base_y + 8, base_x + 6, base_y + 14, WHITE);
        LCD_Fill(base_x + 8, base_y + 4, base_x + 14, base_y + 14, WHITE);
        LCD_DrawRectangle(base_x + 16, base_y, base_x + 22, base_y + 14);
    } else if (cur == WIFI_STATE_DISCONNECTED) {
        LCD_Fill(base_x, base_y + 8, base_x + 6, base_y + 14, WHITE);
        LCD_DrawRectangle(base_x + 8, base_y + 4, base_x + 14, base_y + 14);
        LCD_DrawRectangle(base_x + 16, base_y, base_x + 22, base_y + 14);
    } else {
        POINT_COLOR = WHITE;
        LCD_DrawLine(base_x, base_y, base_x + 15, base_y + 15);
        LCD_DrawLine(base_x, base_y + 15, base_x + 15, base_y);
    }
    POINT_COLOR = BLACK; BACK_COLOR  = WHITE;
}

